Дошкольное_учреждение83/src/Documents/удуТабельПосещаемостиДОУ/удуТабельПосещаемостиДОУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>удуТабельПосещаемостиДОУ</name>
  <registerRecords>InformationRegister.удуСведенияОПосещаемостиДОУ</registerRecords>
  <attributes>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.удуГруппыУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>Воспитатель</name>
    <type>
      <types>CatalogRef.удуСотрудникиОрганизаций</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧастьПосещениеГруппы</name>
    <attributes>
      <name>Ребенок</name>
      <type>
        <types>CatalogRef.удуДети</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакПрисутствия</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаПропускаЗанятия</name>
      <type>
        <types>CatalogRef.удуПричиныПропускаЗанятий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дошкольное_учреждение83/src/InformationRegisters/удуСведенияОПосещаемостиДОУ/удуСведенияОПосещаемостиДОУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>удуСведенияОПосещаемостиДОУ</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПризнакПрисутствия</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаПропускаЗанятия</name>
    <type>
      <types>CatalogRef.удуПричиныПропускаЗанятий</types>
    </type>
  </resources>
  <attributes>
    <name>Воспитатель</name>
    <type>
      <types>CatalogRef.удуСотрудникиОрганизаций</types>
    </type>
  </attributes>
  <dimensions>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Группа</name>
    <type>
      <types>CatalogRef.удуГруппыУчреждения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ребенок</name>
    <type>
      <types>CatalogRef.удуДети</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/Documents/удуТабельПосещаемостиДОУ/ObjectModule.bsl
Функция ПроверитКорректностьЗаполненияТЧ()
	ЕстьОшибки = Ложь;
	
	Для Каждого СтрокаТЧ Из ТабличнаяЧастьПосещениеГруппы Цикл
		Если НЕ СтрокаТЧ.ПризнакПрисутствия И НЕ ЗначениеЗаполнено(СтрокаТЧ.ПричинаПропускаЗанятия) Тогда
			ЕстьОшибки = Истина;
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru = 'При пропуске ребенком занятия необходимо обязательно указывать причину пропуска занятия!'");
			Сообщение.Поле = НСтр("ru = 'ТабличнаяЧастьВоспитанники[" + Формат(СтрокаТЧ.НомерСтроки, "ЧГ=0") + "].ПричинаПропускаЗанятия'");
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();			
			
		КонецЕсли;		
	КонецЦикла;
	
	Возврат ЕстьОшибки;	
КонецФункции

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Отказ = ПроверитКорректностьЗаполненияТЧ();
	
	Движения.удуСведенияОПосещаемостиДОУ.Записывать = Истина;
	Для Каждого ТекСтрокаТабличнаяЧастьПосещениеГруппы Из ТабличнаяЧастьПосещениеГруппы Цикл
		// Hегистр удуСведенияОПосещаемостиДОУ 
		Движение = Движения.удуСведенияОПосещаемостиДОУ.Добавить();
		Движение.Период = Дата;
		Движение.Учреждение = Учреждение;
		Движение.Группа = Группа;
		Движение.Ребенок = ТекСтрокаТабличнаяЧастьПосещениеГруппы.Ребенок;
		Движение.ПризнакПрисутствия = ТекСтрокаТабличнаяЧастьПосещениеГруппы.ПризнакПрисутствия;
		Движение.ПричинаПропускаЗанятия = ТекСтрокаТабличнаяЧастьПосещениеГруппы.ПричинаПропускаЗанятия;		
		Движение.Воспитатель = Воспитатель;
	КонецЦикла;
КонецПроцедуры
